app/controllers/subscribers_controller.rb

SELECT "subscribers".* FROM "subscribers"
---
  def index
    @subscribers = Subscriber.all

SELECT "subscribers".* FROM "subscribers" WHERE ("subscribers"."id" = 980190962) LIMIT 1
---
  def show
    @subscriber = Subscriber.find(params[:id])

SELECT "subscribers".* FROM "subscribers" WHERE ("subscribers"."id" = 980190962) LIMIT 1
---
  def edit
    @subscriber = Subscriber.find(params[:id])

INSERT INTO "subscribers" ("username", "domain", "password", "email_address", "ha1", "ha1b", "rpid", "created_at", "updated_at") VALUES ('test_username_2', 'test_domain_2', 'test_password_2', 'test_email_address_2', 'test_ha1_2', 'test_ha1b_2', 'test_rpid_2', '2011-02-14 14:14:30.228557', '2011-02-14 14:14:30.228557')
---
  def create
    @subscriber = Subscriber.new(params[:subscriber])

    respond_to do |format|
      if @subscriber.save

SELECT "subscribers".* FROM "subscribers" WHERE ("subscribers"."id" = 980190962) LIMIT 1
UPDATE "subscribers" SET "created_at" = '2011-02-14 14:14:30.398153', "updated_at" = '2011-02-14 14:14:30.398153' WHERE ("subscribers"."id" = 980190963)
---
  def update
    @subscriber = Subscriber.find(params[:id])

    respond_to do |format|
      if @subscriber.update_attributes(params[:subscriber])

SELECT "subscribers".* FROM "subscribers" WHERE ("subscribers"."id" = 980190962) LIMIT 1
DELETE FROM "subscribers" WHERE ("subscribers"."id" = 980190962)
---
  def destroy
    @subscriber = Subscriber.find(params[:id])
    @subscriber.destroy